Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.ProfilePrefix Property
 The parametric profile item prefix.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ProfilePrefix { get; set; }
Public Property ProfilePrefix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace